```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_organization.random_string.random: Refreshing state... [id=si38]
data.external.git: Refreshing state... [id=-]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-08-28 03:03:33.431532996 +0000 UTC]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-08-28 03:03:33.573191921 +0000 UTC]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns[0].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/3c2dfec3-f3c6-4573-b359-602f45d0ea3f]
module.dns.module.dns[1].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/f9c38627-5deb-4a5e-b2a6-b303c33d32e9]
module.dns.module.dns[0].aws_acm_certificate.apex_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/e4c418a0-8949-4636-8269-a78eb57b72d9]
module.dns.module.dns[1].aws_acm_certificate.apex_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/c9310a3b-73b9-4dbb-84df-e87027b2b056]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.dns.module.dns[0].aws_route53_zone.zone: Refreshing state... [id=Z09011832P733251NUAHX]
module.dns.module.dns[1].aws_route53_zone.zone: Refreshing state... [id=Z08393103BT7N9U33F6L7]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_logging.aws_cloudtrail.cloudtrail will be created
  + resource "aws_cloudtrail" "cloudtrail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + kms_key_id                    = (known after apply)
      + name                          = "cloudtrail"
      + s3_bucket_name                = "scaffoldly-si38-logs-cloudtrail"

      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::S3::Object"
              + values = [
                  + "arn:aws:s3:::",
                ]
            }
        }
      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::Lambda::Function"
              + values = [
                  + "arn:aws:lambda",
                ]
            }
        }
    }

  # module.aws_logging.aws_kms_key.cloudtrail will be created
  + resource "aws_kms_key" "cloudtrail" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = "cloudtrail"
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Id        = "CloudTrail key policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::656889719924:root",
                              + "arn:aws:sts::656889719924:role/BootstrapAccessRole",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = "kms:GenerateDataKey*"
                      + Condition = {
                          + StringLike = {
                              + kms:EncryptionContext:aws:cloudtrail:arn = "arn:aws:cloudtrail:*:656889719924:trail/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudTrail to encrypt logs"
                    },
                  + {
                      + Action    = "kms:DescribeKey"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudTrail to describe key"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:ReEncryptFrom",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + kms:CallerAccount = "656889719924"
                            }
                          + StringLike   = {
                              + kms:EncryptionContext:aws:cloudtrail:arn = "arn:aws:cloudtrail:*:656889719924:trail/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow principals in the account to decrypt log files"
                    },
                  + {
                      + Action    = "kms:CreateAlias"
                      + Condition = {
                          + StringEquals = {
                              + kms:CallerAccount = "656889719924"
                              + kms:ViaService    = "ec2.us-east-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow alias creation during setup"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:ReEncryptFrom",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + kms:CallerAccount = "656889719924"
                            }
                          + StringLike   = {
                              + kms:EncryptionContext:aws:cloudtrail:arn = "arn:aws:cloudtrail:*:656889719924:trail/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable cross account log decryption"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```